bench/scale_fio/fio_logs/rfuse/randread_128k_32.log
randread: (g=0): rw=randread, bs=(R) 128KiB-128KiB, (W) 128KiB-128KiB, (T) 128KiB-128KiB, ioengine=psync, iodepth=1
...
fio-3.16
Starting 32 processes

randread: (groupid=0, jobs=32): err= 0: pid=300542: Thu Oct  9 16:54:22 2025
  read: IOPS=27.3k, BW=3412MiB/s (3578MB/s)(32.0GiB/9604msec)
    clat (usec): min=4, max=19757, avg=1020.03, stdev=1101.24
     lat (usec): min=4, max=19757, avg=1020.16, stdev=1101.25
    clat percentiles (usec):
     |  1.00th=[   13],  5.00th=[   17], 10.00th=[   22], 20.00th=[   38],
     | 30.00th=[   61], 40.00th=[  494], 50.00th=[  685], 60.00th=[ 1012],
     | 70.00th=[ 1483], 80.00th=[ 1975], 90.00th=[ 2474], 95.00th=[ 2933],
     | 99.00th=[ 3851], 99.50th=[ 4424], 99.90th=[ 8848], 99.95th=[10290],
     | 99.99th=[15926]
   bw (  MiB/s): min= 2551, max= 5636, per=100.00%, avg=3869.14, stdev=30.15, samples=505
   iops        : min=20411, max=45079, avg=30945.81, stdev=241.08, samples=505
  lat (usec)   : 10=0.10%, 20=8.64%, 50=17.41%, 100=7.41%, 250=0.64%
  lat (usec)   : 500=6.21%, 750=12.30%, 1000=7.05%
  lat (msec)   : 2=20.74%, 4=18.72%, 10=0.74%, 20=0.06%
  cpu          : usr=0.29%, sys=8.17%, ctx=213022, majf=0, minf=1314
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=262144,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
   READ: bw=3412MiB/s (3578MB/s), 3412MiB/s-3412MiB/s (3578MB/s-3578MB/s), io=32.0GiB (34.4GB), run=9604-9604msec