bench/scale_fio/fio_logs/rfuse/randread_4k_32.log
randread: (g=0): rw=randread, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=psync, iodepth=1
...
fio-3.16
Starting 32 processes

randread: (groupid=0, jobs=32): err= 0: pid=297143: Thu Oct  9 16:53:48 2025
  read: IOPS=246k, BW=959MiB/s (1006MB/s)(32.0GiB/34164msec)
    clat (nsec): min=199, max=23998k, avg=128017.51, stdev=342353.38
     lat (nsec): min=213, max=23998k, avg=128048.95, stdev=342353.64
    clat percentiles (nsec):
     |  1.00th=[     652],  5.00th=[     780], 10.00th=[     908],
     | 20.00th=[    1208], 30.00th=[    2008], 40.00th=[   69120],
     | 50.00th=[   84480], 60.00th=[  110080], 70.00th=[  146432],
     | 80.00th=[  195584], 90.00th=[  284672], 95.00th=[  378880],
     | 99.00th=[  618496], 99.50th=[  765952], 99.90th=[ 6914048],
     | 99.95th=[ 7831552], 99.99th=[10289152]
   bw (  KiB/s): min=831208, max=1258760, per=100.00%, avg=996719.64, stdev=2510.24, samples=2137
   iops        : min=207802, max=314690, avg=249179.19, stdev=627.55, samples=2137
  lat (nsec)   : 250=0.01%, 500=0.01%, 750=3.76%, 1000=9.70%
  lat (usec)   : 2=16.51%, 4=2.51%, 10=1.64%, 20=2.21%, 50=1.26%
  lat (usec)   : 100=19.09%, 250=30.22%, 500=10.98%, 750=1.58%, 1000=0.24%
  lat (msec)   : 2=0.07%, 4=0.04%, 10=0.17%, 20=0.01%, 50=0.01%
  cpu          : usr=0.54%, sys=3.96%, ctx=5841272, majf=0, minf=326
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=8388608,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
   READ: bw=959MiB/s (1006MB/s), 959MiB/s-959MiB/s (1006MB/s-1006MB/s), io=32.0GiB (34.4GB), run=34164-34164msec