bench/scale_fio/fio_logs/rfuse/randwrite_128k_32.log
randwrite: (g=0): rw=randwrite, bs=(R) 128KiB-128KiB, (W) 128KiB-128KiB, (T) 128KiB-128KiB, ioengine=psync, iodepth=1
...
fio-3.16
Starting 32 processes

fio: terminating on signal 2

fio: terminating on signal 2
fio: job 'randwrite' (state=5) hasn't exited in 300 seconds, it appears to be stuck. Doing forceful exit of this job.

randwrite: (groupid=0, jobs=32): err= 0: pid=310827: Fri Oct 10 00:39:21 2025
  write: IOPS=5347, BW=668MiB/s (701MB/s)(31.0GiB/47499msec); 0 zone resets
    clat (usec): min=20, max=4851.4k, avg=4626.61, stdev=33058.33
     lat (usec): min=21, max=4851.4k, avg=4628.13, stdev=33058.33
    clat percentiles (usec):
     |  1.00th=[    38],  5.00th=[    47], 10.00th=[    58], 20.00th=[    78],
     | 30.00th=[    94], 40.00th=[   116], 50.00th=[   143], 60.00th=[   330],
     | 70.00th=[  1090], 80.00th=[  1467], 90.00th=[  3916], 95.00th=[ 43779],
     | 99.00th=[ 76022], 99.50th=[ 85459], 99.90th=[106431], 99.95th=[112722],
     | 99.99th=[208667]
   bw (  KiB/s): min=259721, max=2857490, per=100.00%, avg=880868.63, stdev=18008.16, samples=2253
   iops        : min= 2023, max=22315, avg=6878.20, stdev=140.62, samples=2253
  lat (usec)   : 50=6.58%, 100=26.50%, 250=25.33%, 500=3.60%, 750=3.40%
  lat (usec)   : 1000=2.89%
  lat (msec)   : 2=16.51%, 4=5.29%, 10=3.10%, 20=0.64%, 50=1.93%
  lat (msec)   : 100=4.05%, 250=0.17%, 500=0.01%, >=2000=0.01%
  cpu          : usr=0.02%, sys=19.19%, ctx=34442580, majf=0, minf=356
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,253984,0,31 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
  WRITE: bw=668MiB/s (701MB/s), 668MiB/s-668MiB/s (701MB/s-701MB/s), io=31.0GiB (33.3GB), run=47499-47499msec
fio: file hash not empty on exit