bench/scale_fio/fio_logs/rfuse/randwrite_128k_4.log
randwrite: (g=0): rw=randwrite, bs=(R) 128KiB-128KiB, (W) 128KiB-128KiB, (T) 128KiB-128KiB, ioengine=psync, iodepth=1
...
fio-3.16
Starting 4 processes

randwrite: (groupid=0, jobs=4): err= 0: pid=308599: Thu Oct  9 16:57:02 2025
  write: IOPS=8124, BW=1016MiB/s (1065MB/s)(4096MiB/4033msec); 0 zone resets
    clat (usec): min=28, max=8379, avg=161.91, stdev=351.61
     lat (usec): min=28, max=8380, avg=162.39, stdev=351.66
    clat percentiles (usec):
     |  1.00th=[   46],  5.00th=[   85], 10.00th=[   96], 20.00th=[  108],
     | 30.00th=[  117], 40.00th=[  129], 50.00th=[  143], 60.00th=[  153],
     | 70.00th=[  163], 80.00th=[  176], 90.00th=[  194], 95.00th=[  221],
     | 99.00th=[  326], 99.50th=[  383], 99.90th=[ 8029], 99.95th=[ 8029],
     | 99.99th=[ 8094]
   bw (  MiB/s): min= 2832, max= 3103, per=100.00%, avg=2968.25, stdev=38.79, samples=8
   iops        : min=22662, max=24830, avg=23746.00, stdev=310.33, samples=8
  lat (usec)   : 50=1.20%, 100=12.20%, 250=83.62%, 500=2.61%, 750=0.03%
  lat (usec)   : 1000=0.03%
  lat (msec)   : 2=0.01%, 4=0.09%, 10=0.22%
  cpu          : usr=0.08%, sys=28.43%, ctx=33438, majf=0, minf=40
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,32768,0,4 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
  WRITE: bw=1016MiB/s (1065MB/s), 1016MiB/s-1016MiB/s (1065MB/s-1065MB/s), io=4096MiB (4295MB), run=4033-4033msec