bench/scale_fio/fio_logs/rfuse/read_128k_1.log
read: (g=0): rw=read, bs=(R) 128KiB-128KiB, (W) 128KiB-128KiB, (T) 128KiB-128KiB, ioengine=psync, iodepth=1
fio-3.16
Starting 1 process

read: (groupid=0, jobs=1): err= 0: pid=266430: Thu Oct  9 16:44:00 2025
  read: IOPS=17.2k, BW=2156MiB/s (2261MB/s)(1024MiB/475msec)
    clat (usec): min=3, max=3305, avg=56.89, stdev=77.39
     lat (usec): min=3, max=3306, avg=56.91, stdev=77.40
    clat percentiles (usec):
     |  1.00th=[    7],  5.00th=[    7], 10.00th=[    7], 20.00th=[    7],
     | 30.00th=[    8], 40.00th=[   10], 50.00th=[   34], 60.00th=[   65],
     | 70.00th=[   78], 80.00th=[   92], 90.00th=[  153], 95.00th=[  196],
     | 99.00th=[  269], 99.50th=[  306], 99.90th=[  371], 99.95th=[  408],
     | 99.99th=[ 3294]
  lat (usec)   : 4=0.01%, 10=40.04%, 20=8.76%, 50=7.65%, 100=30.24%
  lat (usec)   : 250=11.52%, 500=1.73%, 1000=0.01%
  lat (msec)   : 2=0.01%, 4=0.01%
  cpu          : usr=1.69%, sys=46.41%, ctx=3555, majf=0, minf=41
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=8192,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
   READ: bw=2156MiB/s (2261MB/s), 2156MiB/s-2156MiB/s (2261MB/s-2261MB/s), io=1024MiB (1074MB), run=475-475msec