bench/scale_fio/fio_logs/rfuse/read_128k_2.log
read: (g=0): rw=read, bs=(R) 128KiB-128KiB, (W) 128KiB-128KiB, (T) 128KiB-128KiB, ioengine=psync, iodepth=1
...
fio-3.16
Starting 2 processes

read: (groupid=0, jobs=2): err= 0: pid=266519: Thu Oct  9 16:44:02 2025
  read: IOPS=14.4k, BW=1798MiB/s (1885MB/s)(2048MiB/1139msec)
    clat (usec): min=5, max=7901, avg=136.30, stdev=182.13
     lat (usec): min=5, max=7901, avg=136.38, stdev=182.13
    clat percentiles (usec):
     |  1.00th=[    9],  5.00th=[   13], 10.00th=[   15], 20.00th=[   19],
     | 30.00th=[   24], 40.00th=[   31], 50.00th=[   60], 60.00th=[  137],
     | 70.00th=[  167], 80.00th=[  221], 90.00th=[  359], 95.00th=[  478],
     | 99.00th=[  693], 99.50th=[  783], 99.90th=[  922], 99.95th=[ 1696],
     | 99.99th=[ 4293]
   bw (  MiB/s): min= 1709, max= 1873, per=99.62%, avg=1791.25, stdev=48.98, samples=4
   iops        : min=13674, max=14986, avg=14330.00, stdev=391.84, samples=4
  lat (usec)   : 10=2.03%, 20=20.91%, 50=26.34%, 100=4.94%, 250=28.99%
  lat (usec)   : 500=12.55%, 750=3.58%, 1000=0.57%
  lat (msec)   : 2=0.04%, 4=0.03%, 10=0.02%
  cpu          : usr=1.02%, sys=46.13%, ctx=7028, majf=0, minf=85
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=16384,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
   READ: bw=1798MiB/s (1885MB/s), 1798MiB/s-1798MiB/s (1885MB/s-1885MB/s), io=2048MiB (2147MB), run=1139-1139msec