bench/scale_fio/fio_logs/rfuse/read_4k_1.log
read: (g=0): rw=read, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=psync, iodepth=1
fio-3.16
Starting 1 process

read: (groupid=0, jobs=1): err= 0: pid=264597: Thu Oct  9 16:43:31 2025
  read: IOPS=575k, BW=2246MiB/s (2355MB/s)(1024MiB/456msec)
    clat (nsec): min=183, max=1687.1k, avg=1588.96, stdev=12740.23
     lat (nsec): min=194, max=1687.1k, avg=1605.31, stdev=12741.35
    clat percentiles (nsec):
     |  1.00th=[   197],  5.00th=[   270], 10.00th=[   294], 20.00th=[   306],
     | 30.00th=[   310], 40.00th=[   318], 50.00th=[   326], 60.00th=[   334],
     | 70.00th=[   350], 80.00th=[   394], 90.00th=[   510], 95.00th=[   892],
     | 99.00th=[ 58112], 99.50th=[ 73216], 99.90th=[156672], 99.95th=[209920],
     | 99.99th=[387072]
  lat (nsec)   : 250=3.40%, 500=86.29%, 750=3.76%, 1000=2.86%
  lat (usec)   : 2=1.87%, 4=0.22%, 10=0.01%, 20=0.01%, 50=0.28%
  lat (usec)   : 100=1.16%, 250=0.12%, 500=0.03%, 750=0.01%
  lat (msec)   : 2=0.01%
  cpu          : usr=7.47%, sys=53.19%, ctx=3807, majf=0, minf=11
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=262144,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
   READ: bw=2246MiB/s (2355MB/s), 2246MiB/s-2246MiB/s (2355MB/s-2355MB/s), io=1024MiB (1074MB), run=456-456msec