bench/scale_fio/fio_logs/rfuse/read_4k_4.log
read: (g=0): rw=read, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=psync, iodepth=1
...
fio-3.16
Starting 4 processes

read: (groupid=0, jobs=4): err= 0: pid=264824: Thu Oct  9 16:43:35 2025
  read: IOPS=890k, BW=3477MiB/s (3646MB/s)(4096MiB/1178msec)
    clat (nsec): min=185, max=8087.0k, avg=4153.46, stdev=39713.24
     lat (nsec): min=197, max=8087.1k, avg=4185.67, stdev=39713.38
    clat percentiles (nsec):
     |  1.00th=[   342],  5.00th=[   434], 10.00th=[   510], 20.00th=[   588],
     | 30.00th=[   636], 40.00th=[   692], 50.00th=[   740], 60.00th=[   796],
     | 70.00th=[   852], 80.00th=[   940], 90.00th=[  1096], 95.00th=[  1304],
     | 99.00th=[138240], 99.50th=[252928], 99.90th=[444416], 99.95th=[505856],
     | 99.99th=[692224]
   bw (  MiB/s): min= 3429, max= 3471, per=99.23%, avg=3450.41, stdev= 5.93, samples=8
   iops        : min=877942, max=888666, avg=883304.00, stdev=1518.60, samples=8
  lat (nsec)   : 250=0.06%, 500=9.08%, 750=42.77%, 1000=33.17%
  lat (usec)   : 2=12.93%, 4=0.34%, 10=0.07%, 20=0.01%, 50=0.07%
  lat (usec)   : 100=0.35%, 250=0.64%, 500=0.46%, 750=0.05%, 1000=0.01%
  lat (msec)   : 2=0.01%, 4=0.01%, 10=0.01%
  cpu          : usr=9.12%, sys=38.40%, ctx=12754, majf=0, minf=46
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=1048576,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
   READ: bw=3477MiB/s (3646MB/s), 3477MiB/s-3477MiB/s (3646MB/s-3646MB/s), io=4096MiB (4295MB), run=1178-1178msec